; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v10 ?v6)
             (pred_9 ?v13 ?v12)
             (pred_7 ?v10 ?v12)
             (pred_1 ?v8 ?v10 )
	     (pred_10 ?v10)
             (pred_2 ?v4)
             (pred_11 ?v13)
             (pred_12 ?v12)
             (pred_6 ?v10)
             (pred_5 ?v13)
             (pred_8 ?v10)
             (pred_3 ))



(:action op_3
:parameters (?v9 ?v1 ?v7 ?v2)
:precondition (and (pred_2 ?v9) (pred_2 ?v1) (pred_11 ?v7) (pred_12 ?v2)
          (pred_4 ?v9 ?v1) (pred_9 ?v7 ?v2)
                   (pred_7 ?v1 ?v2) (pred_10 ?v9) 
                   (pred_6 ?v1) (pred_5 ?v7))
:effect (and  (pred_8 ?v1) (not (pred_6 ?v1))))


(:action op_1
:parameters (?v9 ?v5)
:precondition (and (pred_2 ?v9) (pred_2 ?v5)
               (pred_10 ?v9) (pred_4 ?v9 ?v5) (pred_8 ?v5))
:effect (and (pred_10 ?v5) (not (pred_10 ?v9))))

(:action op_5
:parameters (?v9 ?v7)
:precondition (and (pred_2 ?v9) (pred_11 ?v7) 
                  (pred_10 ?v9) (pred_1 ?v7 ?v9) (pred_3 ))
:effect (and (pred_5 ?v7)
   (not (pred_1 ?v7 ?v9)) (not (pred_3 ))))


(:action op_2
:parameters (?v9 ?v11 ?v3)
:precondition (and (pred_2 ?v9) (pred_11 ?v11) (pred_11 ?v3)
                  (pred_10 ?v9) (pred_5 ?v3) (pred_1 ?v11 ?v9))
:effect (and (pred_5 ?v11) (pred_1 ?v3 ?v9)
        (not (pred_5 ?v3)) (not (pred_1 ?v11 ?v9))))

(:action op_4
:parameters (?v9 ?v7)
:precondition (and (pred_2 ?v9) (pred_11 ?v7) 
                  (pred_10 ?v9) (pred_5 ?v7))
:effect (and (pred_3 ) (pred_1 ?v7 ?v9) (not (pred_5 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_19 obj_06 obj_03 obj_22 obj_21 obj_25 obj_23 obj_05 obj_11 obj_30 obj_01 obj_28 obj_31 obj_26 obj_27 obj_08 obj_02 obj_29 obj_12 obj_17 obj_16 obj_24 obj_04 obj_13
    obj_20 obj_09 obj_10
    obj_07 obj_18 obj_15
    )

    (:init
       (pred_3)

       (pred_2 obj_14)
       (pred_2 obj_19)
       (pred_2 obj_06)
       (pred_2 obj_03)
       (pred_2 obj_22)
       (pred_2 obj_21)
       (pred_2 obj_25)
       (pred_2 obj_23)
       (pred_2 obj_05)
       (pred_2 obj_11)
       (pred_2 obj_30)
       (pred_2 obj_01)
       (pred_2 obj_28)
       (pred_2 obj_31)
       (pred_2 obj_26)
       (pred_2 obj_27)
       (pred_2 obj_08)
       (pred_2 obj_02)
       (pred_2 obj_29)
       (pred_2 obj_12)
       (pred_2 obj_17)
       (pred_2 obj_16)
       (pred_2 obj_24)
       (pred_2 obj_04)
       (pred_2 obj_13)
       (pred_12 obj_20)
       (pred_12 obj_09)
       (pred_12 obj_10)
       (pred_11 obj_07)
       (pred_11 obj_18)
       (pred_11 obj_15)

       (pred_4 obj_14 obj_21)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_19 obj_25)
       (pred_4 obj_19 obj_06)
       (pred_4 obj_19 obj_14)
       (pred_4 obj_06 obj_23)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_06 obj_19)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_03 obj_22)
       (pred_4 obj_03 obj_06)
       (pred_4 obj_22 obj_11)
       (pred_4 obj_22 obj_03)
       (pred_4 obj_21 obj_30)
       (pred_4 obj_21 obj_25)
       (pred_4 obj_21 obj_14)
       (pred_4 obj_25 obj_01)
       (pred_4 obj_25 obj_23)
       (pred_4 obj_25 obj_19)
       (pred_4 obj_25 obj_21)
       (pred_4 obj_23 obj_28)
       (pred_4 obj_23 obj_05)
       (pred_4 obj_23 obj_06)
       (pred_4 obj_23 obj_25)
       (pred_4 obj_05 obj_31)
       (pred_4 obj_05 obj_11)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_05 obj_23)
       (pred_4 obj_11 obj_26)
       (pred_4 obj_11 obj_22)
       (pred_4 obj_11 obj_05)
       (pred_4 obj_30 obj_27)
       (pred_4 obj_30 obj_01)
       (pred_4 obj_30 obj_21)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_28)
       (pred_4 obj_01 obj_25)
       (pred_4 obj_01 obj_30)
       (pred_4 obj_28 obj_02)
       (pred_4 obj_28 obj_31)
       (pred_4 obj_28 obj_23)
       (pred_4 obj_28 obj_01)
       (pred_4 obj_31 obj_29)
       (pred_4 obj_31 obj_26)
       (pred_4 obj_31 obj_05)
       (pred_4 obj_31 obj_28)
       (pred_4 obj_26 obj_12)
       (pred_4 obj_26 obj_11)
       (pred_4 obj_26 obj_31)
       (pred_4 obj_27 obj_17)
       (pred_4 obj_27 obj_08)
       (pred_4 obj_27 obj_30)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_08 obj_02)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_27)
       (pred_4 obj_02 obj_24)
       (pred_4 obj_02 obj_29)
       (pred_4 obj_02 obj_28)
       (pred_4 obj_02 obj_08)
       (pred_4 obj_29 obj_04)
       (pred_4 obj_29 obj_12)
       (pred_4 obj_29 obj_31)
       (pred_4 obj_29 obj_02)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_12 obj_26)
       (pred_4 obj_12 obj_29)
       (pred_4 obj_17 obj_16)
       (pred_4 obj_17 obj_27)
       (pred_4 obj_16 obj_24)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_16 obj_17)
       (pred_4 obj_24 obj_04)
       (pred_4 obj_24 obj_02)
       (pred_4 obj_24 obj_16)
       (pred_4 obj_04 obj_13)
       (pred_4 obj_04 obj_29)
       (pred_4 obj_04 obj_24)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_13 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_31)
       (pred_6 obj_23)
       (pred_7  obj_03 obj_20)
       (pred_7  obj_31 obj_09)
       (pred_7  obj_23 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_19)
       (pred_8 obj_06)
       (pred_8 obj_22)
       (pred_8 obj_21)
       (pred_8 obj_25)
       (pred_8 obj_05)
       (pred_8 obj_11)
       (pred_8 obj_30)
       (pred_8 obj_01)
       (pred_8 obj_28)
       (pred_8 obj_26)
       (pred_8 obj_27)
       (pred_8 obj_08)
       (pred_8 obj_02)
       (pred_8 obj_29)
       (pred_8 obj_12)
       (pred_8 obj_17)
       (pred_8 obj_16)
       (pred_8 obj_24)
       (pred_8 obj_04)
       (pred_8 obj_13)

       (pred_9  obj_07 obj_20)
       (pred_9  obj_18 obj_09)
       (pred_9  obj_15 obj_10)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_18 obj_26)
       (pred_1 obj_15 obj_12)
       (pred_10 obj_25)
    )

    (:goal (and
       (pred_1 obj_07 obj_21)
       (pred_1 obj_18 obj_11)
       (pred_1 obj_15 obj_11)
    ))
(:constraints
  (always (not (pred_10 obj_05)))
)
)

; plan
1. (op_1 obj_25 obj_01)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_01)
   goals met: 0 of 3
2. (op_1 obj_01 obj_08)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_08)
   goals met: 0 of 3
3. (op_5 obj_08 obj_07)
   deleted: (pred_1 obj_07 obj_08) (pred_3)
   added: (pred_5 obj_07)
   goals met: 0 of 3
4. (op_1 obj_08 obj_02)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_02)
   goals met: 0 of 3
5. (op_1 obj_02 obj_29)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_29)
   goals met: 0 of 3
6. (op_1 obj_29 obj_12)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_12)
   goals met: 0 of 3
7. (op_2 obj_12 obj_15 obj_07)
   deleted: (pred_5 obj_07) (pred_1 obj_15 obj_12)
   added: (pred_5 obj_15) (pred_1 obj_07 obj_12)
   goals met: 0 of 3
8. (op_1 obj_12 obj_26)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_26)
   goals met: 0 of 3
9. (op_2 obj_26 obj_18 obj_15)
   deleted: (pred_5 obj_15) (pred_1 obj_18 obj_26)
   added: (pred_5 obj_18) (pred_1 obj_15 obj_26)
   goals met: 0 of 3
10. (op_1 obj_26 obj_11)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_11)
   goals met: 0 of 3
11. (op_4 obj_11 obj_18)
   deleted: (pred_5 obj_18)
   added: (pred_3) (pred_1 obj_18 obj_11)
   goals met: 1 of 3
12. (op_1 obj_11 obj_26)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_26)
   goals met: 1 of 3
13. (op_5 obj_26 obj_15)
   deleted: (pred_1 obj_15 obj_26) (pred_3)
   added: (pred_5 obj_15)
   goals met: 1 of 3
14. (op_1 obj_26 obj_11)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_11)
   goals met: 1 of 3
15. (op_4 obj_11 obj_15)
   deleted: (pred_5 obj_15)
   added: (pred_3) (pred_1 obj_15 obj_11)
   goals met: 2 of 3
16. (op_1 obj_11 obj_26)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_26)
   goals met: 2 of 3
17. (op_1 obj_26 obj_12)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_12)
   goals met: 2 of 3
18. (op_5 obj_12 obj_07)
   deleted: (pred_1 obj_07 obj_12) (pred_3)
   added: (pred_5 obj_07)
   goals met: 2 of 3
19. (op_1 obj_12 obj_29)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_29)
   goals met: 2 of 3
20. (op_1 obj_29 obj_02)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_02)
   goals met: 2 of 3
21. (op_1 obj_02 obj_28)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_28)
   goals met: 2 of 3
22. (op_1 obj_28 obj_01)
   deleted: (pred_10 obj_28)
   added: (pred_10 obj_01)
   goals met: 2 of 3
23. (op_1 obj_01 obj_25)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_25)
   goals met: 2 of 3
24. (op_1 obj_25 obj_21)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_21)
   goals met: 2 of 3
25. (op_4 obj_21 obj_07)
   deleted: (pred_5 obj_07)
   added: (pred_3) (pred_1 obj_07 obj_21)
   goals met: 3 of 3
